rails-test/app/views/seasons/show.html.erb

SELECT "episodes".* FROM "episodes" WHERE ("episodes".season_id = 1)
---
<ul>
  <% @season.episodes.each do |episode| %>