rails-test/app/controllers/episodes_controller.rb

INSERT INTO "episodes" ("updated_at", "language", "created_at", "number", "name", "description", "season_id") VALUES ('2012-02-01 20:02:39.223663', 'English', '2012-02-01 20:02:39.223663', 1, 'Episode1', '1st episode of Season1', 1)
---
  def create
    @episode = @season.episodes.build(params[:episode])
    if @episode.save

SELECT "seasons".* FROM "seasons" WHERE "seasons"."id" = 1 LIMIT 1
---
  def find_season_show
    @season = Season.find(params[:season_id])

SELECT "episodes".* FROM "episodes" WHERE "episodes"."id" = 1 LIMIT 1
---
  def find_episode
    @episode = Episode.find(params[:id])