rails-test/app/controllers/seasons_controller.rb

INSERT INTO "seasons" ("show_id", "created_at", "updated_at", "number") VALUES (11, '2012-02-05 07:27:19.040338', '2012-02-05 07:27:19.040338', 0)
---
  def create
    @season = @show.seasons.build(params[:season])
    if @season.save

SELECT "shows".* FROM "shows" WHERE "shows"."id" = 1 LIMIT 1
---
  def find_show
    @show = Show.find(params[:show_id])

SELECT "seasons".* FROM "seasons" WHERE "seasons"."id" = 1 LIMIT 1
---
  def find_season
    @season = Season.find(params[:id])