rails-test/app/controllers/shows_controller.rb

SELECT "shows".* FROM "shows" WHERE "shows"."id" = 1 LIMIT 1
---
  def show
    @show = Show.find(params[:id])

SELECT "shows".* FROM "shows" WHERE "shows"."id" = 1 LIMIT 1
---
  def edit
    @show = Show.find(params[:id])

INSERT INTO "shows" ("name", "description", "updated_at", "created_at") VALUES ('Tom&Jerry', 'Tom & Jerry Cartoon show', '2012-02-01 06:59:15.708548', '2012-02-01 06:59:15.708548')
---
  def create
    @show = Show.new(params[:show])

    respond_to do |format|
      if @show.save

SELECT "shows".* FROM "shows" WHERE "shows"."id" = 1 LIMIT 1
---
  def update
    @show = Show.find(params[:id])

SELECT "shows".* FROM "shows" WHERE "shows"."id" = 1 LIMIT 1
DELETE FROM "shows" WHERE "shows"."id" = 1
---
  def destroy
    @show = Show.find(params[:id])
    @show.destroy

SELECT "shows".* FROM "shows"
---
  def list
    @language = params[:language]
    if params[:language].nil?
      @shows = Show.all