rails-test/app/views/shows/show.html.erb

SELECT "seasons".* FROM "seasons" WHERE ("seasons".show_id = 1)
---
<ul>
  <% @show.seasons.each do |season| %>